app/controllers/api/hotels_controller.rb

    def index
      @hotels = Hotel.all
---
SELECT "hotels".* FROM "hotels"

    def create
      @hotel = Hotel.new(params[:hotel])

      if @hotel.save
---
INSERT INTO "hotels" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Fri, 05 Apr 2013 23:51:48 UTC +00:00], ["name", "Bonhomie"], ["updated_at", Fri, 05 Apr 2013 23:51:48 UTC +00:00]]