app/controllers/v1/hotels_controller.rb

SELECT "hotels".* FROM "hotels"
---
  def index
    @hotels = Hotel.all

SELECT "hotels".* FROM "hotels" WHERE "hotels"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @hotel = Hotel.find(params[:id])